Revit 2024 API
OBJExportOptions Class
 The export options used by exporting to OBJ file format.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class OBJExportOptions : BIMExportOptions
Visual Basic
Public Class OBJExportOptions _
	Inherits BIMExportOptions
Visual C++
public ref class OBJExportOptions : public BIMExportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BIMExportOptions
 Autodesk.Revit.DB.OBJExportOptions
See Also
OBJExportOptions Members
Autodesk.Revit.DB Namespace